unet.summary()

__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_9 (InputLayer)            (None, 128, 128, 1)  0                                            
__________________________________________________________________________________________________
conv2d_100 (Conv2D)             (None, 128, 128, 32) 320         input_9[0][0]                    
__________________________________________________________________________________________________
conv2d_101 (Conv2D)             (None, 128, 128, 32) 9248        conv2d_100[0][0]                 
__________________________________________________________________________________________________
max_pooling2d_19 (MaxPooling2D) (None, 64, 64, 32)   0           conv2d_101[0][0]                 
__________________________________________________________________________________________________
conv2d_102 (Conv2D)             (None, 64, 64, 64)   18496       max_pooling2d_19[0][0]           
__________________________________________________________________________________________________
conv2d_103 (Conv2D)             (None, 64, 64, 64)   36928       conv2d_102[0][0]                 
__________________________________________________________________________________________________
max_pooling2d_20 (MaxPooling2D) (None, 32, 32, 64)   0           conv2d_103[0][0]                 
__________________________________________________________________________________________________
conv2d_104 (Conv2D)             (None, 32, 32, 64)   36928       max_pooling2d_20[0][0]           
__________________________________________________________________________________________________
conv2d_105 (Conv2D)             (None, 32, 32, 64)   36928       conv2d_104[0][0]                 
__________________________________________________________________________________________________
max_pooling2d_21 (MaxPooling2D) (None, 16, 16, 64)   0           conv2d_105[0][0]                 
__________________________________________________________________________________________________
conv2d_106 (Conv2D)             (None, 16, 16, 128)  73856       max_pooling2d_21[0][0]           
__________________________________________________________________________________________________
conv2d_107 (Conv2D)             (None, 16, 16, 128)  147584      conv2d_106[0][0]                 
__________________________________________________________________________________________________
max_pooling2d_22 (MaxPooling2D) (None, 8, 8, 128)    0           conv2d_107[0][0]                 
__________________________________________________________________________________________________
conv2d_108 (Conv2D)             (None, 8, 8, 256)    295168      max_pooling2d_22[0][0]           
__________________________________________________________________________________________________
up_sampling2d_19 (UpSampling2D) (None, 16, 16, 256)  0           conv2d_108[0][0]                 
__________________________________________________________________________________________________
conv2d_109 (Conv2D)             (None, 16, 16, 256)  590080      up_sampling2d_19[0][0]           
__________________________________________________________________________________________________
conv2d_110 (Conv2D)             (None, 16, 16, 256)  590080      conv2d_109[0][0]                 
__________________________________________________________________________________________________
concatenate_17 (Concatenate)    (None, 16, 16, 384)  0           conv2d_107[0][0]                 
                                                                 conv2d_110[0][0]                 
__________________________________________________________________________________________________
conv2d_111 (Conv2D)             (None, 16, 16, 256)  884992      concatenate_17[0][0]             
__________________________________________________________________________________________________
up_sampling2d_20 (UpSampling2D) (None, 32, 32, 256)  0           conv2d_111[0][0]                 
__________________________________________________________________________________________________
conv2d_112 (Conv2D)             (None, 32, 32, 256)  590080      up_sampling2d_20[0][0]           
__________________________________________________________________________________________________
conv2d_113 (Conv2D)             (None, 32, 32, 256)  590080      conv2d_112[0][0]                 
__________________________________________________________________________________________________
concatenate_18 (Concatenate)    (None, 32, 32, 320)  0           conv2d_105[0][0]                 
                                                                 conv2d_113[0][0]                 
__________________________________________________________________________________________________
conv2d_114 (Conv2D)             (None, 32, 32, 256)  737536      concatenate_18[0][0]             
__________________________________________________________________________________________________
up_sampling2d_21 (UpSampling2D) (None, 64, 64, 256)  0           conv2d_114[0][0]                 
__________________________________________________________________________________________________
conv2d_115 (Conv2D)             (None, 64, 64, 128)  295040      up_sampling2d_21[0][0]           
__________________________________________________________________________________________________
conv2d_116 (Conv2D)             (None, 64, 64, 128)  147584      conv2d_115[0][0]                 
__________________________________________________________________________________________________
concatenate_19 (Concatenate)    (None, 64, 64, 192)  0           conv2d_103[0][0]                 
                                                                 conv2d_116[0][0]                 
__________________________________________________________________________________________________
conv2d_117 (Conv2D)             (None, 64, 64, 128)  221312      concatenate_19[0][0]             
__________________________________________________________________________________________________
up_sampling2d_22 (UpSampling2D) (None, 128, 128, 128 0           conv2d_117[0][0]                 
__________________________________________________________________________________________________
conv2d_118 (Conv2D)             (None, 128, 128, 64) 73792       up_sampling2d_22[0][0]           
__________________________________________________________________________________________________
conv2d_119 (Conv2D)             (None, 128, 128, 64) 36928       conv2d_118[0][0]                 
__________________________________________________________________________________________________
concatenate_20 (Concatenate)    (None, 128, 128, 96) 0           conv2d_101[0][0]                 
                                                                 conv2d_119[0][0]                 
__________________________________________________________________________________________________
conv2d_120 (Conv2D)             (None, 128, 128, 64) 55360       concatenate_20[0][0]             
__________________________________________________________________________________________________
conv2d_121 (Conv2D)             (None, 128, 128, 1)  577         conv2d_120[0][0]                 
==================================================================================================
Total params: 5,468,897
Trainable params: 5,468,897
Non-trainable params: 0
__________________________________________________________________________________________________
